## [ 결측치 Missing Value 처리 ]
- 데이터 미입력 또는 데이터 저장 과정에서 지워진 데이터
- 빈칸 의미
- 표시 : NaN (Not A Number) NaT(Not A Text)
- 표현 : numpy 모듈의 nan, math 모듈의 nan 사용

(1) 모듈 로딩<hr>

In [2]:
import pandas as pd
import numpy as np

(2) 데이터 준비 <hr>

In [3]:
file = "../../DATA/employees.csv"

(3) 데이터 저장  CSV => DataFrame

In [5]:
# 구분자 : , / 헤더 : 첫번째 줄 컬럼
empDF = pd.read_csv(file)

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

(4) 데이터 확인

In [7]:
# 데이터의 전반적인 요약정보 확인 => info() 메서드
# - 컬럼별 결측치 여부 확인 ==> 실제 데이터에서 결측지 체크 & 처리
# - 컬럼별 데이터 타입과 실제 데이터 타입 비교 => 타입 다른 경우, 타입 변환
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

- 데이터의 컬럼별 분포 확인 => describe() : 컬럼별 기술 통계 값

In [10]:
empDF.describe(include='all')

       First Name  Gender Start Date         Salary  Mgmt Team
count         933     854        999     999.000000   933  957
unique        200       2        971            NaN     2   10
top       Marilyn  Female   10/30/04            NaN  True   IT
freq           11     431          2            NaN   468  106
mean          NaN     NaN        NaN   90655.528529   NaN  NaN
std           NaN     NaN        NaN   32939.511615   NaN  NaN
min           NaN     NaN        NaN   35013.000000   NaN  NaN
25%           NaN     NaN        NaN   62560.000000   NaN  NaN
50%           NaN     NaN        NaN   90427.000000   NaN  NaN
75%           NaN     NaN        NaN  118744.500000   NaN  NaN
max           NaN     NaN        NaN  149908.000000   NaN  NaN

In [15]:
# 최빈값 => mode(), 중앙값 => median()
empDF.mode(numeric_only=True), empDF.median(numeric_only=True), empDF.mean(numeric_only=True)
## 왼쪽에 치우친 분포도를 예상할 수 있음

(     Salary
 0   86676.0
 1   91462.0
 2  121160.0
 3  145988.0
 4  147183.0,
 Salary    90427.0
 dtype: float64,
 Salary    90655.528529
 dtype: float64)

(5) 데이터 전처리(Preprocessing) =>  가. 결측치 처리

- 결측치 확인 ==> isna(), isnull() : 원소 단위로 검사 후 결측치인 경우 True 반환

In [18]:
empDF.columns

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

In [19]:
# 전체 데이터의 컬럼별 결측치 체크
empDF.isna().head(), empDF.isnull().head()

(   First Name  Gender  Start Date  Salary   Mgmt   Team
 0       False   False       False    True  False  False
 1       False   False       False   False  False   True
 2       False   False        True   False  False  False
 3       False    True       False   False  False  False
 4       False   False       False   False  False  False,
    First Name  Gender  Start Date  Salary   Mgmt   Team
 0       False   False       False    True  False  False
 1       False   False       False   False  False   True
 2       False   False        True   False  False  False
 3       False    True       False   False  False  False
 4       False   False       False   False  False  False)

In [21]:
# 전체 데이터의 컬럼별 결측치 체크 후 갯수 파악 => 합계
empDF.isna().sum(), empDF.isnull().sum()

(First Name     68
 Gender        147
 Start Date      2
 Salary          2
 Mgmt           68
 Team           44
 dtype: int64,
 First Name     68
 Gender        147
 Start Date      2
 Salary          2
 Mgmt           68
 Team           44
 dtype: int64)

- 결측치 확인 ==> notna() / notnull() : 결측치가 아니면 True 반환

In [22]:
empDF.notna(), empDF.notnull()

(      First Name  Gender  Start Date  Salary   Mgmt   Team
 0           True    True        True   False   True   True
 1           True    True        True    True   True  False
 2           True    True       False    True   True   True
 3           True   False        True    True   True   True
 4           True    True        True    True   True   True
 ...          ...     ...         ...     ...    ...    ...
 996         True    True        True    True   True   True
 997         True    True        True    True   True   True
 998         True    True        True    True   True   True
 999         True    True        True    True   True   True
 1000       False   False       False   False  False  False

 [1001 rows x 6 columns],
       First Name  Gender  Start Date  Salary   Mgmt   Team
 0           True    True        True   False   True   True
 1           True    True        True    True   True  False
 2           True    True       False    True   True   True
 3           True   False        True    True   True   True
 4           True    True        True    True   True   True
 ...          ...     ...         ...     ...    ...    ...
 996         True    True        True    True   True   True
 997         True    True        True    True   True   True
 998         True    True        True    True   True   True
 999         True    True        True    True   True   True
 1000       False   False       False   False  False  False

 [1001 rows x 6 columns])

In [24]:
# 정상 데이터 갯수 확인
empDF.notna().sum(), empDF.notnull().sum()

(First Name    933
 Gender        854
 Start Date    999
 Salary        999
 Mgmt          933
 Team          957
 dtype: int64,
 First Name    933
 Gender        854
 Start Date    999
 Salary        999
 Mgmt          933
 Team          957
 dtype: int64)

- 결측치 처리 ==> (1) 삭제 : dropna()

In [26]:
## [기본] 모든 행에 1개의 값이라도 NaN이면 삭제

empDF2 = empDF.dropna()     ## 반환값 : 복사본
print(empDF.shape, empDF2.shape)

(1001, 6) (761, 6)

In [27]:
## [설정] 모든 행의 값이 NaN이면 삭제

empDF3 = empDF.dropna(how = 'all')
print(empDF.shape, empDF3.shape)

(1001, 6) (1000, 6)

In [29]:
## [설정] 특정 컬럼의 Na만 체크 후 삭제하는 방법

# 예) 성별에 따른 연봉 분석 => NA면 분석 불가능 컬럼을 지정
empDF4 = empDF.dropna(subset=['Gender','Salary'])   # subset = 리스트
print(empDF.shape, empDF4.shape)

(1001, 6) (853, 6)

In [30]:
## [설정] 컬럼별 정상 데이터 즉 NA가 아닌 데이터의 갯수(컬럼 별 데이터 갯수)를 지정 후
#         해당 수 만큼 정상 데이터가 없는 컬럼 삭제

empDF5 = empDF.dropna(thresh=900, axis=1)   ## Gender의 정상데이터 갯수는 854개 => 900미만 삭제 => Gender 컬럼 삭제  
print(empDF.shape, empDF5.shape)

# 적어도 20% 미만의 결측치를 가진 데이터만 사용하고 싶다면 전체 데이터 갯수가 1000일 때, thresh = 800 으로 지정

(1001, 6) (1001, 5)

- 결측치 처리 => 대체 :fillna()

In [31]:
# Gender 컬럼의 결측 값을 무엇으로 채울지??
empDF.describe(include='all')

       First Name  Gender Start Date         Salary  Mgmt Team
count         933     854        999     999.000000   933  957
unique        200       2        971            NaN     2   10
top       Marilyn  Female   10/30/04            NaN  True   IT
freq           11     431          2            NaN   468  106
mean          NaN     NaN        NaN   90655.528529   NaN  NaN
std           NaN     NaN        NaN   32939.511615   NaN  NaN
min           NaN     NaN        NaN   35013.000000   NaN  NaN
25%           NaN     NaN        NaN   62560.000000   NaN  NaN
50%           NaN     NaN        NaN   90427.000000   NaN  NaN
75%           NaN     NaN        NaN  118744.500000   NaN  NaN
max           NaN     NaN        NaN  149908.000000   NaN  NaN

In [34]:
# ==> 컬럼의 최빈값으로 na 채우기
empDF.Gender.mode()[0]    # empDF.Gender.mode()의 type : Series  =>  값을 지정할 때 인덱스 이용
genSR = empDF.Gender.fillna(empDF.Gender.mode()[0])
genSR.isna().sum()   # => 0

In [38]:
# ==> NA값 이전과 이후 값으로 채우기 => method = 'ffill' or method = 'bfill'
empDF.Gender.fillna(method='bfill')   ## bfill로 채우면 마지막값 NaN값

0         Male
1         Male
2       Female
3         Male
4         Male
         ...
996       Male
997       Male
998       Male
999       Male
1000       NaN
Name: Gender, Length: 1001, dtype: object

In [52]:
empDF.Gender.mode()

0    Female
Name: Gender, dtype: object

In [39]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, np.nan],
                    [np.nan, 3, np.nan, 4]],
                    columns=list("ABCD"))   # 하나씩 뜯어서 들어감

In [40]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [43]:
df.A.fillna(method = 'ffill', limit = 1)   # 이전거를 채우되 한번만 채우겠다 -> 채우는 최대 갯수

0    NaN
1    3.0
2    3.0
3    NaN
Name: A, dtype: float64

In [44]:
df.A.fillna(method = 'bfill')  # 뒤 값이 NaN값이라서 2, 3 값 안 채워짐

0    3.0
1    3.0
2    NaN
3    NaN
Name: A, dtype: float64

In [ ]:
# 컬럼별로 원하는 값으로 채울 수도 있음

values = {"A": 0, "B": 1, "C": 2, "D": 3}
df.fillna(value=values)

In [49]:
# DF으로 채울 수도 있음

df2 = pd.DataFrame(np.zeros([4, 4]), columns=list("ABCE"))  # zeros((4,4)) => 4행 4열로 만들어진 DF에 값을 모두 0으로 채워라
## But, 컬럼 값 달라서 채워줄 수가 없음 => df의 D 컬럼을 변화 X
df.fillna(df2)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  NaN
3  0.0  3.0  0.0  4.0

In [46]:
# B 컬럼과 D 컬럼을 평균으로 결측치를 대체   / 이상치에 대한 대비 X => 중앙값으로 대체하는 것이 나을수도 O

df.B.fillna(df.B.mean())
df.D.fillna(df.D.mean())

0    0.000000
1    1.000000
2    1.666667
3    4.000000
Name: D, dtype: float64

0    2.0
1    3.0
2    4.0
Name: B, dtype: float64